# 데이터 전처리 2

In [1]:
import pandas as pd

df = pd.read_csv('data/vehicle_prod.csv')
df

  Unnamed: 0   2007   2008   2009   2010   2011
0      China   7.71   7.95  11.96  15.84  16.33
1         EU  19.02  17.71  15.00  16.70  17.48
2         US  10.47   8.45   5.58   7.60   8.40
3      Japan  10.87  10.83   7.55   9.09   7.88
4      Korea   4.04   3.78   3.45   4.20   4.62
5     Mexico   2.01   2.05   1.50   2.25   2.54

### 컬럼명 바꾸기

In [2]:

df1 = df.rename(columns={'Unnamed: 0' : 'Country'})  
df1

  Country   2007   2008   2009   2010   2011
0   China   7.71   7.95  11.96  15.84  16.33
1      EU  19.02  17.71  15.00  16.70  17.48
2      US  10.47   8.45   5.58   7.60   8.40
3   Japan  10.87  10.83   7.55   9.09   7.88
4   Korea   4.04   3.78   3.45   4.20   4.62
5  Mexico   2.01   2.05   1.50   2.25   2.54

### 기존 열을 인덱스로 설정하는 함수 

함수 _set_index('지정한 열', inplace = True(원본) / False(리턴) )

In [3]:

df1.set_index('Country', inplace=True)

In [4]:
df1

          2007   2008   2009   2010   2011
Country
China     7.71   7.95  11.96  15.84  16.33
EU       19.02  17.71  15.00  16.70  17.48
US       10.47   8.45   5.58   7.60   8.40
Japan    10.87  10.83   7.55   9.09   7.88
Korea     4.04   3.78   3.45   4.20   4.62
Mexico    2.01   2.05   1.50   2.25   2.54

### 국가명을 컬럼으로 인덱스 설정하고 바로 데이터 프레임생성

In [10]:
odf = pd.read_csv('data/vehicle_prod.csv', index_col=0)
odf

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [11]:
ofd['2007'] #2007의 인덱스값 출력

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [ ]:
odf[['2007']] #2007의 인덱스를 가시성 있게 출력

         2007
China    7.71
EU      19.02
US      10.47
Japan   10.87
Korea    4.04
Mexico   2.01

In [14]:
odf.columns.tolist()

['2007', '2008', '2009', '2010', '2011']

## ✅ 개념 정리: .columns.tolist()  
DataFrame.columns는 컬럼명(열 이름)들을 인덱스 객체(Index)로 반환합니다.

여기에 .tolist()를 붙이면 그걸 리스트로 변환합니다.

In [ ]:
# 컬렴명(열 이름)들을 인덱스 객체(Index)로 반환

odf.columns

Index(['2007', '2008', '2009', '2010', '2011'], dtype='object')

In [16]:
# .tolist()를 붙이면 리스트로 반환

odf.columns.tolist()

['2007', '2008', '2009', '2010', '2011']

In [ ]:
odf['2007'] # odf의 2007년의 인덱스값 호출

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [ ]:
odf['2007'].tolist() #2007년의 인덱스 값의 리스트화

[7.71, 19.02, 10.47, 10.87, 4.04, 2.01]

In [ ]:
odf.describe()

            2007       2008       2009       2010       2011
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean    9.020000   8.461667   7.506667   9.280000   9.541667
std     6.019661   5.557519   5.142621   5.935921   6.105887
min     2.010000   2.050000   1.500000   2.250000   2.540000
25%     4.957500   4.822500   3.982500   5.050000   5.435000
50%     9.090000   8.200000   6.565000   8.345000   8.140000
75%    10.770000  10.235000  10.857500  14.152500  14.347500
max    19.020000  17.710000  15.000000  16.700000  17.480000

## ✅ 개념 정리: DataFrame.describe()  
describe()는 수치형(Numeric) 데이터의 대표 통계 지표들을 한눈에 보여줍니다.

기본적으로 아래 항목들이 출력됩니다:

| 지표        | 설명                |
| --------- | ----------------- |
| **count** | 결측치가 아닌 데이터 개수    |
| **mean**  | 평균값               |
| **std**   | 표준편차 (데이터의 분산 정도) |
| **min**   | 최소값               |
| **25%**   | 1사분위수 (Q1)        |
| **50%**   | 중앙값 (Q2, median)  |
| **75%**   | 3사분위수 (Q3)        |
| **max**   | 최대값               |

### ✅ 실무에서 쓰는 경우

🔹 1. 데이터 분포 확인 (이상치, 스케일 확인용)

```odf.describe() ```

max와 min 차이가 너무 크면 이상치 존재 가능

std가 너무 크면 값이 널뛰기 함 → 정규화 필요성 판단

*정규화란 ?*
* 데이터의 값의 범위를 일정하게 조정하는 작업을 뜻합니다.

*정규화가 필요한 이유*

| 상황         | 이유                                                     |
| ---------- | ------------------------------------------------------ |
| 머신러닝 학습 전에 | 스케일이 다르면 **학습 성능**이 떨어짐 (예: KNN, SVM, 회귀모델 등 거리 기반 모델) |
| 데이터 시각화    | 큰 값 때문에 작은 값이 안 보이는 경우, 시각화 왜곡 방지                      |
| 이상치 탐지     | 값 범위가 비슷해야 이상치가 뚜렷하게 드러남                               |
| PCA 등 차원축소 | 모든 feature가 같은 기준이어야 올바르게 작동함                          |

🔹 2. 결측치 확인

```odf.describe().loc['count'] == len(odf)```

False가 나오면 결측치가 존재하는 열이라는 뜻

In [24]:
odf.describe().iloc[:] == len(odf) # 전체 결측치 확인

        2007   2008   2009   2010   2011
count   True   True   True   True   True
mean   False  False  False  False  False
std    False  False  False  False  False
min    False  False  False  False  False
25%    False  False  False  False  False
50%    False  False  False  False  False
75%    False  False  False  False  False
max    False  False  False  False  False

🔹 3. 범주형 포함 요약 보고 싶을 때

```odf.describe(include='all')```

수치형뿐 아니라 문자형, 날짜형 등 모든 열의 요약 정보도 확인 가능

문자형에는 unique, top, freq가 나옴

🔹 4. 특정 열만 describe

```odf[['sales', 'profit']].describe()```

관심 있는 열만 뽑아서 확인 가능

# ✅ 상관분석
변수들 간의 변화의 유사도,
- 음의상관: 서로 반대 방향으로 변화, 증가>감소, 감소>증가
- 양의상관: 서로 같은 방향으로 변화, 증가>증가, 감소>감소

## ✅ 개념: corr()이란?
.corr()는 데이터프레임 내 수치형 열들 간의 선형 상관관계를 계산합니다.
기본적으로 **피어슨 상관계수(Pearson correlation coefficient)**를 사용합니다.

📌 상관계수(Pearson correlation coefficient)
값 범위: –1 ~ +1

의미:
| 상관계수 | 해석                         |
| ---- | -------------------------- |
| +1   | 완전한 양의 상관관계 (같이 증가)        |
| 0    | 상관관계 없음                    |
| –1   | 완전한 음의 상관관계 (한쪽 증가, 한쪽 감소) |

In [25]:
odf.corr()

          2007      2008      2009      2010      2011
2007  1.000000  0.991073  0.831447  0.769040  0.758271
2008  0.991073  1.000000  0.872296  0.810529  0.789512
2009  0.831447  0.872296  1.000000  0.988513  0.980025
2010  0.769040  0.810529  0.988513  1.000000  0.992667
2011  0.758271  0.789512  0.980025  0.992667  1.000000

In [30]:
odf.sum(axis=1, numeric_only=True)

China     59.79
EU        85.91
US        40.50
Japan     46.22
Korea     20.09
Mexico    10.35
dtype: float64

In [32]:
# 2007~2011 년까지의 생산량을 합한 total_production 컬럼을 생성해보자
odf['total_production'] = df.sum(axis=1, numeric_only=True)
odf

         2007   2008   2009   2010   2011  total_production
China    7.71   7.95  11.96  15.84  16.33               NaN
EU      19.02  17.71  15.00  16.70  17.48               NaN
US      10.47   8.45   5.58   7.60   8.40               NaN
Japan   10.87  10.83   7.55   9.09   7.88               NaN
Korea    4.04   3.78   3.45   4.20   4.62               NaN
Mexico   2.01   2.05   1.50   2.25   2.54               NaN